---
kind: other
id: Events.T:Autodesk.Revit.DB.Macros.DocumentEntryPoint
source: html/b9636b10-aff0-912e-9513-fa1b9222eccb.htm
---
# DocumentEntryPoint Events

Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.